example/non-dim/0.atmospheric/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/initialConditions";

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform $pInitial;

boundaryField
{
    outer
    {
        type            zeroGradient;
    }
    inner
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
