example/non-dim/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  2012                                  |
  |   \\  /    A nd           | Website:  www.openfoam.com                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "system/Fluid";
	object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
ddtSchemes{default        CrankNicolson 0.9;}

divSchemes{
default Gauss linear;
}

gradSchemes
{
	default         leastSquares;
}

laplacianSchemes{default        Gauss linear corrected;}

snGradSchemes
{
    default        corrected;
}
wallDist
{
    method          meshWave;
}

// ************************************************************************* //
